PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
        return false;
    }
    else
        return true;

} /* End of testPCP_checkDataConsistency */



/**
 * Test function for priority ceiling portocol. To be called from a sub-set of tasks, idle
 * task, task1ms and taskCpuLoad.
 *   The test is aimed to prove the correct implementation of the offered mutual exclusion
 * mechanism for this sub-set of tasks.
 *   @param idTask
 * The ID (or index) of the calling task. Needed to identify the task related counter.
 */
static void testPCP(unsigned int idTask)
{
    /* Increment task related counter and shared counter in an atomic operation. */
    if(idTask == idTaskIdle)
    {
        GetResource(idTaskIdle, RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskIdle;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource(idTaskIdle);
    }
    else if(idTask == idTaskCpuLoad)
    {
        GetResource(idTaskCpuLoad, RESOURCE_TEST_PCP);
        {
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTaskCpuLoad;
            ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
        }
        ReleaseResource(idTaskCpuLoad);
    }
    else if(idTask == idTask1ms)
    {
        /* Here, we want to prove that the resource doesn't need to be acquired by a task,
           which has the highest priority in the sub-set.
             Omitting the critical section code invalidates the code if the task priorities
           are redefined in the heading part of the file and we need to put an assertion to
           double check this. */
        _Static_assert( prioTask1ms >= prioTaskIdle  &&  prioTask1ms >= prioTaskCpuLoad
                      , "Task priorities do not meet the requirements of function testPCP"
                      );
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTask1ms;
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.cntTotal;
    }
    else
    {
        /* This function is intended only for a sub-set of tasks. */
#ifdef DEBUG
        assert(false);
# else
        /* PRODUCTION compilation: Code execution can be halted only by the OS process. We
           leave this to the idle task.
             Note, incrementing the error count to make the idle task recognize the problem
           is not safe, we don't have a critical section for the given task. */
        ++ _sharedDataTasksIdleAnd1msAndCpuLoad.noErrors;
#endif
    }

    /* Validate the consistency of the redundant data in an atomic operation. */
    bool bOkay;
    GetResource(idTask, RESOURCE_TEST_PCP);
    {
        bOkay = testPCP_checkDataConsistency();
    }
    ReleaseResource(idTask);

#ifdef DEBUG
    assert(bOkay);
#else
    /* PRODUCTION compilation: Code execution can be halted only by the OS process. Not
       all of the errors will become visible by LED. */
    if(idTask >= firstOsTaskId  &&  !bOkay)
        rtos_OS_suspendProcess(/* PID */ 1);
#endif
} /* End of testPCP. */


/**
 * A regularly triggered interrupt handler for the timer PIT1. The interrupt does nothing
 * but counting a variable. The ISR participates the test of safely sharing data with the
 * application tasks. It is triggered at medium frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context
 * switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit1(void)
{
    checkAndIncrementTaskCnts(idISRPit1);
    ++ mai_cntISRPit1;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG1.B.TIF = 0x1;

} /* End of isrPit1 */



/**
 * A regularly triggered interrupt handler for the timer PIT2. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit2(void)
{
    ++ mai_cntISRPit2;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG2.B.TIF = 0x1;

} /* End of isrPit2 */



/**
 * A regularly triggered interrupt handler for the timer PIT3. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit3(void)
{
    ++ mai_cntISRPit3;

    /* Acknowledge the interrupt in the causing HW device. Can be done as this is "trusted
       code" that is running in supervisor mode. */
    PIT.TFLG3.B.TIF = 0x1;

} /* End of isrPit3 */



/**
 * OS task function, cyclically activated every Millisecond. Used to clock the step
 * functions of our I/O drivers.\n
 *   This task is run in supervisor mode and it has no protection. The implementation
 * belongs into the sphere of trusted code.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process.
 */
static int32_t taskOs1ms(void)
{
    /* The I/O driver for the buttons is run from the OS task with priority
       prioTaskOs1ms = 2. The driver code and the callback onButtonChangeCallback it may
       invoke inherit this priority. */
    lbd_task1ms();

    return 0;

} /* End of taskOs1ms */


/**
 * Notification callback from the button and LED I/O driver (lbd) in case of a button state
 * change.\n
 *   Note, the button driver is run in the context of task taskOs1ms. Driver and this
 * callback inherit the priority of that task, which is prioTaskOs1ms = 2.
 *   @param PID
 * A user task or callback gets the process ID as first argument.
 *   @param buttonState
 * The new, changed button state. See lbd_onButtonChangeCallback_t for details.
 */
static int32_t onButtonChangeCallback(uint32_t PID ATTRIB_UNUSED, uint8_t buttonState)
{
    /* Toggle the LED colors on button SW3 down. */
    if((buttonState & lbd_btStMask_btnSw3_down) != 0)
    {
        static unsigned int cntButtonPress_ SECTION(.sbss.P1) = 0;

        lbd_setLED(_ledTask1s, /* isOn */ false);
        lbd_setLED(_ledTask1ms, /* isOn */ false);
        _ledTask1s  = (cntButtonPress_ & 0x1) != 0? lbd_led_D5_red: lbd_led_D5_grn;
        _ledTask1ms = (cntButtonPress_ & 0x2) != 0? lbd_led_D4_red: lbd_led_D4_grn;

        /* Activate the non cyclic task a second time. The priority of the activated
           task (3) is higher than of this activating callback (2) so any earlier
           activation should have been processed meanwhile and this one should be accepted,
           too. */ 
#ifdef DEBUG
        bool bActivationAccepted =
#endif
        rtos_triggerEvent(idEvNonCyclic);
        assert(bActivationAccepted);

        /* Activate our button down event task. The activation will normally succeed
           but at high load and very fast button press events it is theoretically
           possible that not. We don't place an assertion. */
#ifdef DEBUG
        bActivationAccepted =
#endif
        rtos_triggerEvent(idEvOnButtonDown);
        //assert(bActivationAccepted);

        ++ cntButtonPress_;
    }

