PeterVranken/TRK-USB-MPC5643L/LSM/safe-RTOS-VLE/code/application/default/mai_main.c
} /* taskIdlePID2 */


/**
 * Entry point into C code. The C main function is entered without arguments and despite of
 * its return code definition it must never be left. (Returning from main would enter an
 * infinite loop in the calling assembler startup code.)
 */
void main(void)
{
    /* The first operation of the main function is the call of ihw_initMcuCoreHW(). The
       assembler implemented startup code has brought the MCU in a preliminary working
       state, such that the C compiler constructs can safely work (e.g. stack pointer is
       initialized, memory access through MMU is enabled).
         ihw_initMcuCoreHW() does the remaining hardware initialization, that is still
       needed to bring the MCU in a basic stable working state. The main difference to the
       preliminary working state of the assembler startup code is the selection of
       appropriate clock rates.
         This part of the hardware configuration is widely application independent. The
       only reason, why this code has not been called directly from the assembler code
       prior to entry into main() is code transparency. It would mean to have a lot of C
       code without an obvious point, where it is called. */
    ihw_initMcuCoreHW();

    /* The interrupt controller is configured. */
    prc_initINTCInterruptController();

    /* Initialize the button and LED driver for the eval board. */
    lbd_initLEDAndButtonDriver(onButtonChangeCallback, pidOnButtonChangeCallback);

    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_initSerialInterface(/* baudRate */ 115200);

    /* Arm the memory protection unit. */
    mpu_initMPU();

    /* Register the process initialization tasks. */
    rtos_taskDesc_t taskConfig;
    bool initOk = true;
    taskConfig = (rtos_taskDesc_t){ .PID = 1
                                    , .userTaskFct = taskInitProcess
                                    , .tiTaskMaxInUS = 1000
                                  };
    if(!rtos_registerTask(&taskConfig, RTOS_EVENT_ID_INIT_TASK))
        initOk = false;

    taskConfig = (rtos_taskDesc_t){ .PID = 2
                                    , .userTaskFct = taskInitProcess
                                    , .tiTaskMaxInUS = 1000
                                  };
    if(!rtos_registerTask(&taskConfig, RTOS_EVENT_ID_INIT_TASK))
        initOk = false;

    /* Create the events that trigger application tasks at the RTOS. Note, we do not really
       respect the ID, which is assigned to the event by the RTOS API rtos_createEvent().
       The returned value is redundant. This technique requires that we create the events
       in the right order and this requires in practice a double-check by assertion - later
       maintenance errors are unavoidable otherwise. */
#ifdef DEBUG
    unsigned int idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 1
                                        , .tiFirstActivationInMs = 10
                                        , .priority = prioTask1ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv1ms);
    if(!rtos_registerTask( &(rtos_taskDesc_t){ .PID = pidTaskOs1ms
                                             , .osTaskFct = taskOs1ms
                                             , .tiTaskMaxInUS = 0
                                             }
                         , idEv1ms
                         )
      )
    {
        initOk = false;
    }
    if(!rtos_registerTask( &(rtos_taskDesc_t){ .PID = pidTask1ms
                                             , .userTaskFct = task1ms
                                             , .tiTaskMaxInUS = 0
                                             }
                         , idEv1ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 3
                                        , .tiFirstActivationInMs = 17
                                        , .priority = prioTask3ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv3ms);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask3ms
                                            , .userTaskFct = task3ms
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv3ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 1000
                                        , .tiFirstActivationInMs = 100
                                        , .priority = prioTask1s
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv1s);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask1s
                                            , .userTaskFct = task1s
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv1s
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 0 /* non-cyclic */
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTaskNonCyclic
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvNonCyclic);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskNonCyclic
                                            , .userTaskFct = taskNonCyclic
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvNonCyclic
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 17
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTask17ms
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEv17ms);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTask17ms
                                            , .userTaskFct = task17ms
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEv17ms
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 0 /* Event task, no cycle time */
                                        , .tiFirstActivationInMs = 0
                                        , .priority = prioTaskOnButtonDown
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvOnButtonDown);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskOnButtonDown
                                            , .userTaskFct = taskOnButtonDown
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvOnButtonDown
                         )
      )
    {
        initOk = false;
    }

#ifdef DEBUG
    idEvent =
#endif
    rtos_createEvent(&(rtos_eventDesc_t){ .tiCycleInMs = 23 /* ms */
                                        , .tiFirstActivationInMs = 3
                                        , .priority = prioTaskCpuLoad
                                        , .minPIDToTriggerThisEvent = 1
                                        }
                    );
    assert(idEvent == idEvCpuLoad);
    if(!rtos_registerTask(&(rtos_taskDesc_t){ .PID = pidTaskCpuLoad
                                            , .userTaskFct = taskCpuLoad
                                            , .tiTaskMaxInUS = 0
                                            }
                         , idEvCpuLoad
                         )
      )
    {
        initOk = false;
    }

    /* The last check ensures that we didn't forget to register a task. */
    assert(idEvent == noRegisteredTasks-2);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk || !rtos_initKernel())
        while(true)
            ;

